In [6]:
import pandas as pd

In [7]:
filename = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv"
df = pd.read_csv(filename)

In [8]:
df.head

<bound method NDFrame.head of             Artist                            Album  Released   Length  \
0  Michael Jackson                         Thriller      1982  0:42:19
1            AC/DC                    Back in Black      1980  0:42:11
2       Pink Floyd        The Dark Side of the Moon      1973  0:42:49
3  Whitney Houston                    The Bodyguard      1992  0:57:44
4        Meat Loaf                  Bat Out of Hell      1977  0:46:33
5           Eagles  Their Greatest Hits (1971-1975)      1976  0:43:08
6         Bee Gees             Saturday Night Fever      1977  1:15:54
7    Fleetwood Mac                          Rumours      1977  0:40:01

                         Genre  Music Recording Sales (millions)  \
0               pop, rock, R&B                              46.0
1                    hard rock                              26.1
2             progressive rock                              24.2
3               R&B, soul, pop                              27.4
4  hard rock, progressive rock                              20.6
5   rock, soft rock, folk rock                              32.2
6                        disco                              20.6
7                    soft rock                              27.9

   Claimed Sales (millions) Released.1 Soundtrack  Rating
0                        65  30-Nov-82        NaN    10.0
1                        50  25-Jul-80        NaN     9.5
2                        45  01-Mar-73        NaN     9.0
3                        44  17-Nov-92          Y     8.5
4                        43  21-Oct-77        NaN     8.0
5                        42  17-Feb-76        NaN     7.5
6                        40  15-Nov-77          Y     7.0
7                        40  04-Feb-77        NaN     6.5  >

In [12]:
q = df[["Rating"]]
q

   Rating
0    10.0
1     9.5
2     9.0
3     8.5
4     8.0
5     7.5
6     7.0
7     6.5

In [14]:
q = df[["Released", "Artist"]]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac

In [18]:
df.iloc[1,2]

1980

In [21]:
df_new = df
df_new.index = ["a", "b", "c", "d", "e", "f", "g", "h"]
df_new.loc["a", "Artist"]
df_new.loc["a":"d", "Artist"]

a    Michael Jackson
b              AC/DC
c         Pink Floyd
d    Whitney Houston
Name: Artist, dtype: object